; Завдання (додаткові 2 бала): 
; 1. Додати до спискової структури ще підструктури “Телефон” та “Адреса”.
; 2. Створити список зі своїми власними даними.
; 3. Написати функції “який-телефон” та “яка-адреса”, які видають відповідні значення з введених списків.

(defun який-телефон (x) (car (cdadar (cddddr (caddr x)))))
(defun яка-адреса (x) (car (cdadar (cddddr (cdaddr x)))))
(defun extra-task (x) 
	(print (який-телефон x))
	(print (яка-адреса x)))


(setq cpisok '(СТУДЕНТ (УЧЕНЬ) 
		((ПІБ (ТЕКСТ (Ільйов Дмитро Андрійович))) 
		(ГРУППА (ТЕКСТ (ІО-12))) 
		(ФАКУЛЬТЕТ (ТЕКСТ (ІОТ))) 
		(ДНЮХА (ДАТА (16 02 2004)))
		(телефон (НОМЕР (38 067 497 95 97)))
		(адреса (ТЕКСТ (43583 Тернопільська область м. Тернопіль просп. Прорізна 16))))))


(extra-task cpisok)
